---
kind: property
id: P:Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylPatternMap
source: html/354f564a-14f4-dc08-e9aa-c3c9301c1921.htm
---
# Autodesk.Revit.DB.Visual.PlasticVinyl.PlasticvinylPatternMap Property

The property labeled "Image" from the "PlasticVinyl" schema.

## Syntax (C#)
```csharp
public static string PlasticvinylPatternMap { get; }
```

## Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.